In [2]:
import pandas as pd

In [3]:
purchase_1=({"Name":"Chandrakant","Iten purchase":"Day found","cost":22.55})

purchase_2=({"Name":"Nilesh","Iten purchase":"Kittey litter","cost":2.50})

purchase_3=({"Name":"Binod","Iten purchase":"Bird seed","cost":5.00})

df=pd.DataFrame([purchase_1,purchase_2,purchase_3],index=["store_1","store_1","store_2"])
df.head()

                Name  Iten purchase   cost
store_1  Chandrakant      Day found  22.55
store_1       Nilesh  Kittey litter   2.50
store_2        Binod      Bird seed   5.00

In [4]:
df.loc["store_2"]

Name                 Binod
Iten purchase    Bird seed
cost                     5
Name: store_2, dtype: object

In [5]:
df.loc["store_1"]

                Name  Iten purchase   cost
store_1  Chandrakant      Day found  22.55
store_1       Nilesh  Kittey litter   2.50

In [6]:
df.loc["store_1","cost"]

store_1    22.55
store_1     2.50
Name: cost, dtype: float64

In [7]:
#Transpose
df.T

                   store_1        store_1    store_2
Name           Chandrakant         Nilesh      Binod
Iten purchase    Day found  Kittey litter  Bird seed
cost                 22.55            2.5          5

In [8]:
df.loc[:,["Name","cost"]]

                Name   cost
store_1  Chandrakant  22.55
store_1       Nilesh   2.50
store_2        Binod   5.00

In [9]:
#iloc
df.iloc[0]

Name             Chandrakant
Iten purchase      Day found
cost                   22.55
Name: store_1, dtype: object

In [10]:
df.iloc[0:3]

                Name  Iten purchase   cost
store_1  Chandrakant      Day found  22.55
store_1       Nilesh  Kittey litter   2.50
store_2        Binod      Bird seed   5.00

In [11]:
#droping the data
df.drop("store_1")

          Name Iten purchase  cost
store_2  Binod     Bird seed   5.0

In [12]:
copy_df=df.copy()
copy_df=copy_df.drop("store_1")
copy_df

          Name Iten purchase  cost
store_2  Binod     Bird seed   5.0

In [13]:
df["location"]=None
df

                Name  Iten purchase   cost location
store_1  Chandrakant      Day found  22.55     None
store_1       Nilesh  Kittey litter   2.50     None
store_2        Binod      Bird seed   5.00     None

In [14]:
cost=df["cost"]
cost

store_1    22.55
store_1     2.50
store_2     5.00
Name: cost, dtype: float64

In [15]:
#Adding the cost values by 2
cost+=2
cost

store_1    24.55
store_1     4.50
store_2     7.00
Name: cost, dtype: float64

In [16]:
df

                Name  Iten purchase   cost location
store_1  Chandrakant      Day found  24.55     None
store_1       Nilesh  Kittey litter   4.50     None
store_2        Binod      Bird seed   7.00     None

In [17]:
df1=pd.DataFrame({"ID":[1,2,3,4],
                  "Name":["A","B","C","D"],
                  "Class":[5,6,7,8]})
df1

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8

In [18]:
df2=pd.DataFrame({"ID":[3,4],
                  "Name":["C","D"],
                  "Class":[7,8]})
df2

   ID Name  Class
0   3    C      7
1   4    D      8

In [19]:
pd.concat([df1,df2])

   ID Name  Class
0   1    A      5
1   2    B      6
2   3    C      7
3   4    D      8
0   3    C      7
1   4    D      8

In [20]:
pd.concat([df1,df2],axis=1)

   ID Name  Class   ID Name  Class
0   1    A      5  3.0    C    7.0
1   2    B      6  4.0    D    8.0
2   3    C      7  NaN  NaN    NaN
3   4    D      8  NaN  NaN    NaN

In [21]:
#JOIN
pd.concat([df1,df2],axis=1,join="inner")

   ID Name  Class  ID Name  Class
0   1    A      5   3    C      7
1   2    B      6   4    D      8

In [36]:
df_1=pd.DataFrame({"A":[1,2,3],
                  "B":[10,20,30]},index=["a","b","c"])
df_2=pd.DataFrame({"C":[4,5,6],
                   "D":[40,50,60]},index=["a","b","c"])

In [38]:
display(df_1,df_2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50
c  6  60

In [39]:
df1.join(df2)

   A   B  C   D
a  1  10  4  40
b  2  20  5  50
c  3  30  6  60

In [41]:
df2.join(df1)

   C   D  A   B
a  4  40  1  10
b  5  50  2  20
c  6  60  3  30

In [66]:
pd.concat([df1,df2],keys=["df1","df2"])

         A     B    C     D
df1 a  1.0  10.0  NaN   NaN
    b  2.0  20.0  NaN   NaN
    c  3.0  30.0  NaN   NaN
df2 a  NaN   NaN  4.0  40.0
    b  NaN   NaN  5.0  50.0
    c  NaN   NaN  6.0  60.0

In [67]:
pd.concat([df1,df2],keys=(["Firsr_df","Second_df"]))

               A     B    C     D
Firsr_df  a  1.0  10.0  NaN   NaN
          b  2.0  20.0  NaN   NaN
          c  3.0  30.0  NaN   NaN
Second_df a  NaN   NaN  4.0  40.0
          b  NaN   NaN  5.0  50.0
          c  NaN   NaN  6.0  60.0

In [50]:
#Join using non equal parametera
df_1=pd.DataFrame({"A":[1,2,3],
                  "B":[10,20,30]},index=["a","b","c"])
df_2=pd.DataFrame({"C":[4,5],
                   "D":[40,50]},index=["a","b"])
display(df_1,df_2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [52]:
df_1.join(df_2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [54]:
#how
#right(Intersection)
df_1.join(df_2,how="right")

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [55]:
#Outer(Union)
df_1.join(df_2,how="outer")

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [58]:
#Append
df3=pd.DataFrame({"A":[1,2,3],
                  "B":[10,20,30]})
df4=pd.DataFrame({"A":[4,5,6],
                  "B":[40,50,60]})
display(df3,df4)

   A   B
0  1  10
1  2  20
2  3  30

   A   B
0  4  40
1  5  50
2  6  60

In [61]:
df3.append(df4,ignore_index=True)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60

In [63]:
df4.append(df3,ignore_index=True)

   A   B
0  4  40
1  5  50
2  6  60
3  1  10
4  2  20
5  3  30

In [64]:
#sort
df3.append(df4,ignore_index=True,sort=False)

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50
5  6  60